In [1]:
import pandas as pd

In [9]:
df1=pd.DataFrame(
{"city":["new york", "chicago", "orlando"],
 "temperature":[5, 14,10]}
)

In [10]:
df1

       city  temperature
0  new york            5
1   chicago           14
2   orlando           10

In [8]:
df2=pd.DataFrame(
{"city":["new york", "chicago", "orlando"],
 "humidity":[55, 49,20]}
)
df2

       city  humidity
0  new york        55
1   chicago        49
2   orlando        20

In [13]:
df=pd.merge(df1, df2, on="city")
df

       city  temperature  humidity
0  new york            5        55
1   chicago           14        49
2   orlando           10        20

In [17]:
df3=pd.DataFrame(
{"city":["new york", "chicago", "orlando", "baltimore"],
 "temperature":[5, 14,10, 23]}
)
df3

        city  temperature
0   new york            5
1    chicago           14
2    orlando           10
3  baltimore           23

In [27]:
df4=pd.DataFrame(
{"city":["new york", "chicago",  "los_angeles"],
 "humidity":[55, 49, 33]}
)
df4

          city  humidity
0     new york        55
1      chicago        49
2  los_angeles        33

In [35]:
df=pd.merge(df3, df4, on="city", indicator=True) ## inner join
df

       city  temperature  humidity _merge
0  new york            5        55   both
1   chicago           14        49   both

In [34]:
df=pd.merge(df3, df4, on="city", how="outer", indicator=True) ## outer join
df

          city  temperature  humidity      _merge
0     new york          5.0      55.0        both
1      chicago         14.0      49.0        both
2      orlando         10.0       NaN   left_only
3    baltimore         23.0       NaN   left_only
4  los_angeles          NaN      33.0  right_only

In [32]:
df=pd.merge(df3, df4, on="city", how="left", indicator=True) ## left join
df

        city  temperature  humidity     _merge
0   new york            5      55.0       both
1    chicago           14      49.0       both
2    orlando           10       NaN  left_only
3  baltimore           23       NaN  left_only

In [33]:
df=pd.merge(df3, df4, on="city", how="right", indicator=True) ## right join
df

          city  temperature  humidity      _merge
0     new york          5.0        55        both
1      chicago         14.0        49        both
2  los_angeles          NaN        33  right_only

In [ ]:
## (df1,df2) -- >df1-left, df2 - right

In [40]:
df1=pd.DataFrame(
{"city":["new york", "chicago", "orlando", "baltimore"],
 "temperature":[5, 14,10, 23],
 "humidity":[11,122,13,14]
    })
df1

        city  temperature  humidity
0   new york            5        11
1    chicago           14       122
2    orlando           10        13
3  baltimore           23        14

In [41]:
df2=pd.DataFrame(
{"city":["new york", "chicago", "mumbai", "delho"],
 "temperature":[14, 13,12, 23],
 "humidity":[10,12,33,34]
    })
df2

       city  temperature  humidity
0  new york           14        10
1   chicago           13        12
2    mumbai           12        33
3     delho           23        34

In [44]:
pd.merge(df1, df2, on ="city", suffixes=["_left", "_right"])

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,5,11,14,10
1,chicago,14,122,13,12